In [1]:
list(range(10))
import numpy as np
np.array([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [4]:
np.array([1,2,3,4,5]) #1차원

array([1, 2, 3, 4, 5])

In [5]:
np.array([3,1.4,2,3,4]) 
#float 선언 안해도 하나라도 '실수(소숫점 있는 1.4)'가 있으면 그 크기에 맞게 알아서 설정해 줌

array([3. , 1.4, 2. , 3. , 4. ])

In [6]:
np.array([[1,2],[3,4]])

array([[1, 2],
       [3, 4]])

In [7]:
np.array([1,2,3,4], dtype='float') #데이터 타입 선언 = dtype

array([1., 2., 3., 4.])

In [12]:
arr = np.array([1,2,3,4], dtype=float)

In [13]:
arr.dtype #12번 줄 arr타입 참고. dtype가 float로 선언됨을 나타냄

dtype('float64')

In [14]:
arr.astype #타입 변경 명령어 astype

In [15]:
arr.astype(int) #int로 타입 변경함

array([1, 2, 3, 4])

In [ ]:
import numpy as np  #numpy를 np로 쓴다고 얘기한 것!!

In [16]:
np.zeros(10, dtype=int)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [18]:
np.ones((3,5), dtype=float)

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [19]:
np.arange(0,20,2)

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [22]:
np.linspace(0,1,5) #linspace는 어디에서 어디까지 숫자를 n등분 한다는 명령어

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [32]:
np.random.random((2,2)) #구조= 넘파이.패키지.모듈(얼마,얼마). 모듈= 제약조건.
#

array([[0.37774902, 0.06122168],
       [0.13988148, 0.63314291]])

In [28]:
np.random.normal(0,1,(2,2)) #2,2 행렬로 만듦

array([[-0.486175  ,  0.13071441],
       [ 0.3671638 ,  2.11565928]])

In [31]:
np.random.randint(0,10,(2,2)) 
#0~10까지 숫자를 랜덤으로 선택하여 (2,2)행렬로 만듦

array([[4, 7],
       [3, 1]])

In [36]:
x2=np.random.randint(10,size=(3,4)) #x2가 이거라고 지정함

In [35]:
x2.ndim #x2가 몇 차원인지 물음

2

In [37]:
x2.shape #x2의 행렬 모양을 물음

(3, 4)

In [38]:
x2.size #x2의 행렬 원소 개수를 물음

12

In [39]:
x2.dtype #x2의 데이터 타입()를 물음

dtype('int32')

In [44]:
x=np.arange(7) #x 를 넘파이 행렬 0~6인 7개 숫자가 있는 행렬로 만듦

In [51]:
x[3] #x에 3이라는 원소가 출력됨

3

In [50]:
x[7]#x index7이 없기에 에러남

IndexError: index 7 is out of bounds for axis 0 with size 7

In [49]:
x[0]=10 #x값 중 0을 10으로 전환시킴.

In [52]:
x[0] #이제 10나옴

10

In [57]:
x[0]=0 #원상복귀

In [58]:
x=np.arange(7)

In [59]:
x[1:4] #x 배열 중 1~4번째에 선언된것만 불러 옴

array([1, 2, 3])

In [60]:
x[1:] #x 배열 중 1부터 선언된것만 불러 옴

array([1, 2, 3, 4, 5, 6])

In [61]:
x[:4] #x 배열 중 ~4번째에 선언된것만 불러 옴

array([0, 1, 2, 3])

In [62]:
x[::2] #step 2씩 출력

array([0, 2, 4, 6])

In [63]:
x=np.arange(8)
x

array([0, 1, 2, 3, 4, 5, 6, 7])

In [64]:
x.shape

(8,)

In [67]:
x2=x.reshape((2,4)) #x2는 x를 2,4 행렬로 재배열 한 것
x2

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [68]:
x2.shape

(2, 4)

- concatenate ()이어붙이기

In [77]:
x=np.array([0,1,2])
y=np.array([3,4,5])
np.concatenate([x,y])

array([0, 1, 2, 3, 4, 5])

In [78]:
mat=np.arange(4)
mat

array([0, 1, 2, 3])

In [79]:
mat=np.arange(4).reshape(2,2)
mat

array([[0, 1],
       [2, 3]])

In [84]:
np.concatenate([mat,mat],axis=0)

array([[0, 1],
       [2, 3],
       [0, 1],
       [2, 3]])

In [85]:
np.concatenate([mat,mat],axis=1)

array([[0, 1, 0, 1],
       [2, 3, 2, 3]])

In [87]:
mat1 = np.arange(16).reshape(4,4)

In [88]:
mat1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [89]:
a=np.concatenate([mat1,mat1],axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [91]:
upper, lower = np.split(mat1,[2],axis=0)

In [92]:
upper

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [93]:
lower

array([[ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [127]:
u=upper+lower
u

array([[ 8, 10, 12, 14],
       [16, 18, 20, 22]])

In [95]:
left, right = np.split(mat1,[2],axis=1)

In [96]:
left

array([[ 0,  1],
       [ 4,  5],
       [ 8,  9],
       [12, 13]])

In [97]:
right

array([[ 2,  3],
       [ 6,  7],
       [10, 11],
       [14, 15]])

In [99]:
def afta(values): #afta = add five to array
    output = np.empty(len(values))
    for i in range(len(values)):
        output[i]=values[i]+5
    return output
values=np.random.randint(1,10,size=5)
afta(values)

array([12., 11., 11., 14.,  7.])

In [100]:
x=np.arange(4)

In [101]:
x+5

array([5, 6, 7, 8])

In [102]:
x-5

array([-5, -4, -3, -2])

In [103]:
x*5

array([ 0,  5, 10, 15])

In [104]:
x/5

array([0. , 0.2, 0.4, 0.6])

In [105]:
x=np.arange(4).reshape((2,2))
y=np.random.randint(10,size=(2,2))

In [107]:
x+y

array([[ 5,  7],
       [11,  9]])

In [108]:
x-y

array([[-5, -5],
       [-7, -3]])

- 행과 열 더하기

In [111]:
np.arange(3)

array([0, 1, 2])

In [109]:
np.arange(3).reshape((3,1))

array([[0],
       [1],
       [2]])

In [110]:
np.arange(3).reshape((3,1))+np.arange(3)

array([[0, 1, 2],
       [1, 2, 3],
       [2, 3, 4]])

In [116]:
np.arange(8)

array([0, 1, 2, 3, 4, 5, 6, 7])

In [118]:
x=np.arange(8).reshape((2,4))
x

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [119]:
np.sum(x) #원소들 전체 합

28

In [120]:
np.min(x)

0

In [121]:
np.max(x)

7

In [122]:
np.average(x)

3.5

In [123]:
x

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [124]:
np.sum(x,axis=0) #행 기준으로 더함. 가로로 쪼개서 서로 더한 것.

array([ 4,  6,  8, 10])

In [125]:
np.sum(x,axis=1) #열 기준으로 더함. 세로로 각각 쪼개서 서로 모두 더한 것.

array([ 6, 22])

In [128]:
x=np.arange(5)
x

array([0, 1, 2, 3, 4])

In [129]:
x<3

array([ True,  True,  True, False, False])

In [130]:
x>5

array([False, False, False, False, False])

In [131]:
x[x<3] #판다스 문법

array([0, 1, 2])

In [132]:
import pandas as pd
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [136]:
data=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [137]:
data

a    1
b    2
c    3
d    4
dtype: int64

In [138]:
data['b']

2

In [139]:
data.b

2

In [141]:
data2=pd.Series([1,2,3,4,5],index=['수','우','미','양','가'])

In [145]:
data2

수    1
우    2
미    3
양    4
가    5
dtype: int64

In [142]:
data2['우'] #이것과 아래 어떤 형식으로 쓰든 나옴

2

In [144]:
data2.우

2

In [151]:
def 학생():
    print("김태욱")

In [152]:
학생()

김태욱

In [153]:
data2=pd.Series([1,2,3,4,5],index=['수','우','미','양','가'])

In [163]:
population_dict = {
'korea': 5180,
'japan': 12718,
'china': 141500,
'usa': 32676
}
population = pd.Series(population_dict)
population

korea      5180
japan     12718
china    141500
usa       32676
dtype: int64

In [172]:
gdp_dict = {
'korea': 169320000,
'japan': 516700000,
'china': 1409250000,
'usa': 2041280000,
}
gdp = pd.Series(gdp_dict)
country = pd.DataFrame({ ##dataframe 때문에 표가 나오는 것?
'population': population,
'gdp': gdp
})
gdp

korea     169320000
japan     516700000
china    1409250000
usa      2041280000
dtype: int64

In [166]:
gdp=pd.Series(gdp_dict)
country=pd.DataFrame({
    'population':population,
    'gdp':gdp
    
})
country

       population         gdp
korea        5180   169320000
japan       12718   516700000
china      141500  1409250000
usa         32676  2041280000

In [167]:
country.index
country.columns
country['gdp']
type(country)

pandas.core.series.Series

In [188]:
gdp_per_capita = country['gdp']/country['population']
country['gdp per capita']=gdp_per_capita
gdp_per_capita

korea    32687.258687
japan    40627.457147
china     9959.363958
usa      62470.314604
dtype: float64

In [189]:
gdp=pd.Series(gdp_dict)
country=pd.DataFrame({
    'population':population,
    'gdp':gdp
    'gdp per capita':gdp_per_capita
})
country

SyntaxError: invalid syntax (<ipython-input-189-e44d67697f80>, line 5)

In [179]:
country

       population         gdp
korea        5180   169320000
japan       12718   516700000
china      141500  1409250000
usa         32676  2041280000

In [176]:
country.to_csv("./country.csv")
country.to_excelel("country.xlsx")

country=pd.to_csv("./country.csv")
country=pd.to_excelel("country.xlsx")

AttributeError: module 'pandas' has no attribute 'to_csv'

In [180]:
pd.read_csv("./country.csv")

  Unnamed: 0  population         gdp
0      korea        5180   169320000
1      japan       12718   516700000
2      china      141500  1409250000
3        usa       32676  2041280000

loc = location(행과 열이 직관적), iloc = index location (키 값으로 감.)
행과 열을 인덱스로 접하냐 아니면 데이터프레임으로 접근하냐 차이

In [183]:
country

       population         gdp
korea        5180   169320000
japan       12718   516700000
china      141500  1409250000
usa         32676  2041280000

In [184]:
country.iloc[0]

population         5180
gdp           169320000
Name: korea, dtype: int64

In [193]:
country.iloc[1:3, :2]

       population         gdp
japan       12718   516700000
china      141500  1409250000

In [195]:
country.iloc[1:3, :3]

       population         gdp  gdp per capita
japan       12718   516700000    40627.457147
china      141500  1409250000     9959.363958

In [196]:
dataframe=pd.DataFrame(columns=['이름','나이','주소'])
dataframe

Empty DataFrame
Columns: [이름, 나이, 주소]
Index: []

In [197]:
dataframe.loc[0]=['김태욱','23','서울']
dataframe

    이름  나이  주소
0  김태욱  23  서울

In [201]:
dataframe.loc[1]={'이름':'홍길동','나이':'26','주소':'인천'} #괄호가 다름
dataframe

    이름  나이  주소
0  김태욱  23  서울
1  홍길동  26  인천

In [202]:
dataframe.loc[2,'이름']='쯔위'
dataframe #NaN = 원래 데이터가 들어가야 하는데 데이터가 안 들어감.

    이름   나이   주소
0  김태욱   23   서울
1  홍길동   26   인천
2   쯔위  NaN  NaN

In [205]:
dataframe.loc[3]={'이름':'김태리','나이':'29','주소':'서울'}
dataframe

    이름   나이   주소
0  김태욱   23   서울
1  홍길동   26   인천
2   쯔위  NaN  NaN
3  김태리   29   서울

In [206]:
dataframe['전화번호']=np.nan
dataframe['전화번호']

0   NaN
1   NaN
2   NaN
3   NaN
Name: 전화번호, dtype: float64

In [207]:
dataframe

    이름   나이   주소  전화번호
0  김태욱   23   서울   NaN
1  홍길동   26   인천   NaN
2   쯔위  NaN  NaN   NaN
3  김태리   29   서울   NaN

In [208]:
dataframe.loc[3,'전화번호']='01051235869'
dataframe

    이름   나이   주소         전화번호
0  김태욱   23   서울          NaN
1  홍길동   26   인천          NaN
2   쯔위  NaN  NaN          NaN
3  김태리   29   서울  01051235869

In [209]:
len(dataframe)

4

In [210]:
dataframe["이름"]

0    김태욱
1    홍길동
2     쯔위
3    김태리
Name: 이름, dtype: object

In [211]:
dataframe[["이름", "주소", "나이"]]

    이름   주소   나이
0  김태욱   서울   23
1  홍길동   인천   26
2   쯔위  NaN  NaN
3  김태리   서울   29

해야 할 것. [실습3]indexing & slicing. 
pandas 연산과 함수

In [212]:
dataframe.isnull()
dataframe.notnull()

     이름     나이     주소   전화번호
0  True   True   True  False
1  True   True   True  False
2  True  False  False  False
3  True   True   True   True

In [216]:
dataframe.dropna()
dataframe['전화번호']=dataframe['전화번호'].fillna('전화번호 없음')
dataframe

    이름   나이   주소         전화번호
0  김태욱   23   서울      전화번호 없음
1  홍길동   26   인천      전화번호 없음
2   쯔위  NaN  NaN      전화번호 없음
3  김태리   29   서울  01051235869

In [217]:
A=pd.Series([2,4,6], index=[0,1,2])
B=pd.Series([1,3,5], index=[1,2,3])
A+B
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [222]:
dataframe

    이름   나이   주소         전화번호
0  김태욱   23   서울      전화번호 없음
1  홍길동   26   인천      전화번호 없음
2   쯔위  NaN  NaN      전화번호 없음
3  김태리   29   서울  01051235869

DataFrame 질문!!

In [223]:
A=pd.Dataframe(np.random.randint(0,10,(2,2)),columns=list("AB"))
B=pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list("BAC"))
A+B
A.add(B,fill_value=0)

AttributeError: module 'pandas' has no attribute 'dataframe'